taylor-cone-jet-EHD/Taylor-Cone-Jet-2D/system/refine/topoSetDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c3;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
			p1          (0  -0.100 0);
			p2          (0   0.001 0);
			radius      0.001;
       }
    }
);

// ************************************************************************* //
